tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="info" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="10000" />
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="1000" unit="second">
      <users maxnumber="10000" arrivalrate="500" unit="second" />
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535" />
  </options>

  <sessions>
    <session name="http-login" probability="100" type="ts_http">
      <request subst="true">
        <http url="/users" method="POST" content_type="application/json" contents="{&quot;name&quot;: &quot;Teste&quot;, &quot;email&quot;: &quot;any@mail.com&quot;, &quot;cellphone&quot;: &quot;11 1111-1111&quot;}" />
      </request>
    </session>
  </sessions>
</tsung>